"""
Этот модуль содержит переменные для работы с текстовыми данными.

Определения переменных:
- MAINTENANCE_TEXT: Уведомление о не работе нейросети, без определения.
- LACK_OF_FUNDS_TEXT: Уведомление о недостатке средств у пользователя.
- WORD_PROCESSING_PROBLEM: Проблема с обработкой изображения.
- NEURAL_NETWORK_PROBLEM: Отрицательная обработка запроса к AI.

"""

# from aiogram.utils.i18n.context import lazy_gettext as __
#
# MAINTENANCE_TEXT = __('Эта нейросеть сейчас на техническом обслуживании, повторите попытку немного позднее')
# AI_NOT_FOUND_TEXT = __('Эта нейросеть недоступна в данный момент. Повторите попытку позже.')
#
# BALANCE_ERROR_TEXT = __(
#     '🏋️ <b>Недостаточно энергии для выполнения запроса.</>\n\n'
#     'Необходимо энергии: <b>⚡️{cost}</>\n'
#     'Ваш баланс: <b>⚡️{balance}\n\n</>'
#     'Восполняйте энергию приглашая друзей или ее можно купить в разделе премиум.'
# )
#
# IMAGE_PROCESSING_ERROR_TEXT = __('Произошла ошибка при обработке изображения. Пожалуйста, попробуйте еще раз.')
# NEURAL_NETWORK_PROBLEM = __('Произошла проблема на стороне сервиса нейросети. Пожалуйста, повторите попытку позднее.')
